#include <stdio.h>
#include <math.h>
int main()
{
   int x;
   double y;
   scanf("%d", &x);
   if 
   (
      //#1_begin------------
      1 <= x && x<= 9 // <--第1空, 请把解答写在//左边, 本行上方切勿插入空行
      //#1_end==============     
   )
      y = x * x;
   else
   {
   if
      (
         //#2_begin------------
          (x >= 10 && x < 100 && x % 2 == 0)||((1000 > x && x >= 100) && x % 2 == 1)                     // <--第2空, 请把解答写在//左边, 本行上方切勿插入空行
         //#2_end==============     
      )
         y = 1.0/x;
      else 
      {
         if
         (
            //#3_begin------------
            x >= 1000 && (x / (int)pow(10 , (int)log10(x)) )% 3 == 0                     // <--第3空, 请把解答写在//左边, 本行上方切勿插入空行
            //#3_end==============                       
         )
            y = sqrt(x);
         else
            y = -1;
      }
   }
   printf("%lf\n", y);
   return 0;
}
